examples/docs/xml_exemplo/cancelarNfse_request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <CancelarNfse xmlns="http://www.e-governeapps2.com.br/">
      <CancelarNfseEnvio>
        <Pedido>
          <InfPedidoCancelamento>
            <IdentificacaoNfse xsi:nil="true" />
            <CodigoCancelamento>string</CodigoCancelamento>
          </InfPedidoCancelamento>
          <Signature Id="ID">
            <SignedInfo xsi:nil="true" xmlns="http://www.w3.org/2000/09/xmldsig#" />
            <SignatureValue xsi:nil="true" xmlns="http://www.w3.org/2000/09/xmldsig#" />
            <KeyInfo xsi:nil="true" xmlns="http://www.w3.org/2000/09/xmldsig#" />
            <Object xsi:nil="true" xmlns="http://www.w3.org/2000/09/xmldsig#" />
            <Object xsi:nil="true" xmlns="http://www.w3.org/2000/09/xmldsig#" />
          </Signature>
        </Pedido>
      </CancelarNfseEnvio>
    </CancelarNfse>
  </soap:Body>
</soap:Envelope>